app/Models/AllianceModel.php

    public function getAlliances($slug = false)
    {
        if ($slug === false)
        {
            return $this->findAll();
---
SELECT *
FROM `alliances`