app/Models/BattleModel.php

SELECT *
FROM `battles`
WHERE `Attacker` = 'PUNKY'
---
    public function getUserBattles($slug = false)
    {
        if ($slug === false)
        {
            return $this->findAll();
        }

        return $this->where(['Attacker' => $slug])->findall();