app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'PUNKY'
 LIMIT 1
---
    public function auth($data)
    {
        $user = $this->where(['username' => $data['username']])->first();

SELECT *
FROM `users`
---
    public function getUsers($slug = false)
    {
        if ($slug === false)
        {
            return $this->findAll();

SELECT *
FROM `users`
WHERE `id` = '646'
 LIMIT 1
---
    public function getUserById($userid)
    {
        return $this->where(['id'=>$userid])->first();